## Terraform Plan Output - nprd - bastion
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bastion.azurerm_public_ip.bastion["eastus"] will be created
  + resource "azurerm_public_ip" "bastion" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "dbdemo-nprd-bastion-eastus-pip"
      + public_ip_prefix_id     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-pips-eastus-rg/providers/Microsoft.Network/publicIPPrefixes/dbdemo-nprd-pips-eastus-pippf"
      + resource_group_name     = "dbdemo-nprd-bastion-eastus-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.bastion.azurerm_public_ip.bastion["eastus2"] will be created
  + resource "azurerm_public_ip" "bastion" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus2"
      + name                    = "dbdemo-nprd-bastion-eastus2-pip"
      + public_ip_prefix_id     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-pips-eastus2-rg/providers/Microsoft.Network/publicIPPrefixes/dbdemo-nprd-pips-eastus2-pippf"
      + resource_group_name     = "dbdemo-nprd-bastion-eastus2-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.bastion.azurerm_resource_group.this["eastus"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dbdemo-nprd-bastion-eastus-rg"
      + tags     = {
          + "environment" = "nprd"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "bastion"
        }
    }

  # module.bastion.azurerm_resource_group.this["eastus2"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "dbdemo-nprd-bastion-eastus2-rg"
      + tags     = {
          + "environment" = "nprd"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "bastion"
        }
    }

  # module.bastion.module.bastion_host["eastus"].azurerm_bastion_host.bastion will be created
  + resource "azurerm_bastion_host" "bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = true
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "dbdemo-nprd-bastion-eastus-snap"
      + resource_group_name    = "dbdemo-nprd-bastion-eastus-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Standard"
      + tags                   = {
          + "environment" = "nprd"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "bastion"
        }
      + tunneling_enabled      = true

      + ip_configuration {
          + name                 = "bastion-eastus-pip"
          + public_ip_address_id = (known after apply)
          + subnet_id            = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/AzureBastionSubnet"
        }
    }

  # module.bastion.module.bastion_host["eastus2"].azurerm_bastion_host.bastion will be created
  + resource "azurerm_bastion_host" "bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = true
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus2"
      + name                   = "dbdemo-nprd-bastion-eastus2-snap"
      + resource_group_name    = "dbdemo-nprd-bastion-eastus2-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Standard"
      + tags                   = {
          + "environment" = "nprd"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "bastion"
        }
      + tunneling_enabled      = true

      + ip_configuration {
          + name                 = "bastion-eastus2-pip"
          + public_ip_address_id = (known after apply)
          + subnet_id            = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw/subnets/AzureBastionSubnet"
        }
    }

  # module.bastion.module.naming["eastus"].random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.bastion.module.naming["eastus"].random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.bastion.module.naming["eastus2"].random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.bastion.module.naming["eastus2"].random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>